Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/icm.h
/* -------- ICM_WPMR : (ICM Offset: 0xE4) (R/W 32) ICM Write Protection Mode Register -------- */
#define ICM_WPMR_WPEN_Pos                     _UINT32_(0)                                          /* (ICM_WPMR) Write Protection Enable Position */
#define ICM_WPMR_WPEN_Msk                     (_UINT32_(0x1) << ICM_WPMR_WPEN_Pos)                 /* (ICM_WPMR) Write Protection Enable Mask */
#define ICM_WPMR_WPEN(value)                  (ICM_WPMR_WPEN_Msk & (_UINT32_(value) << ICM_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the ICM_WPMR register */
#define ICM_WPMR_WPITEN_Pos                   _UINT32_(1)                                          /* (ICM_WPMR) Write Protection Interrupt Enable Position */
#define ICM_WPMR_WPITEN_Msk                   (_UINT32_(0x1) << ICM_WPMR_WPITEN_Pos)               /* (ICM_WPMR) Write Protection Interrupt Enable Mask */
#define ICM_WPMR_WPITEN(value)                (ICM_WPMR_WPITEN_Msk & (_UINT32_(value) << ICM_WPMR_WPITEN_Pos)) /* Assigment of value for WPITEN in the ICM_WPMR register */
#define ICM_WPMR_WPCREN_Pos                   _UINT32_(2)                                          /* (ICM_WPMR) Write Protection Control Enable Position */
#define ICM_WPMR_WPCREN_Msk                   (_UINT32_(0x1) << ICM_WPMR_WPCREN_Pos)               /* (ICM_WPMR) Write Protection Control Enable Mask */
#define ICM_WPMR_WPCREN(value)                (ICM_WPMR_WPCREN_Msk & (_UINT32_(value) << ICM_WPMR_WPCREN_Pos)) /* Assigment of value for WPCREN in the ICM_WPMR register */
#define ICM_WPMR_WPKEY_Pos                    _UINT32_(8)                                          /* (ICM_WPMR) Write Protection Key Position */
#define ICM_WPMR_WPKEY_Msk                    (_UINT32_(0xFFFFFF) << ICM_WPMR_WPKEY_Pos)           /* (ICM_WPMR) Write Protection Key Mask */
#define ICM_WPMR_WPKEY(value)                 (ICM_WPMR_WPKEY_Msk & (_UINT32_(value) << ICM_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the ICM_WPMR register */
#define   ICM_WPMR_WPKEY_PASSWD_Val           _UINT32_(0x49434D)                                   /* (ICM_WPMR) Writing any other value in this field aborts the write operation of the WPEN, WPITEN and WPCREN bits. Always reads as 0  */
#define ICM_WPMR_WPKEY_PASSWD                 (ICM_WPMR_WPKEY_PASSWD_Val << ICM_WPMR_WPKEY_Pos)    /* (ICM_WPMR) Writing any other value in this field aborts the write operation of the WPEN, WPITEN and WPCREN bits. Always reads as 0 Position  */
#define ICM_WPMR_Msk                          _UINT32_(0xFFFFFF07)                                 /* (ICM_WPMR) Register Mask  */


/* -------- ICM_WPSR : (ICM Offset: 0xE8) ( R/ 32) ICM Write Protection Status Register -------- */
#define ICM_WPSR_WPVS_Pos                     _UINT32_(0)                                          /* (ICM_WPSR) Write Protection Violation Status (Cleared on read) Position */
#define ICM_WPSR_WPVS_Msk                     (_UINT32_(0x1) << ICM_WPSR_WPVS_Pos)                 /* (ICM_WPSR) Write Protection Violation Status (Cleared on read) Mask */
#define ICM_WPSR_WPVS(value)                  (ICM_WPSR_WPVS_Msk & (_UINT32_(value) << ICM_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the ICM_WPSR register */
#define ICM_WPSR_WPVSRC_Pos                   _UINT32_(8)                                          /* (ICM_WPSR) Write Protection Violation Source Position */
#define ICM_WPSR_WPVSRC_Msk                   (_UINT32_(0xFF) << ICM_WPSR_WPVSRC_Pos)              /* (ICM_WPSR) Write Protection Violation Source Mask */
#define ICM_WPSR_WPVSRC(value)                (ICM_WPSR_WPVSRC_Msk & (_UINT32_(value) << ICM_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the ICM_WPSR register */
#define ICM_WPSR_Msk                          _UINT32_(0x0000FF01)                                 /* (ICM_WPSR) Register Mask  */


/** \brief ICM register offsets definitions */
#define ICM_RADDR_REG_OFST             _UINT32_(0x00)      /* (ICM_RADDR) Region Start Address Offset */
#define ICM_RCFG_REG_OFST              _UINT32_(0x04)      /* (ICM_RCFG) Region Configuration Offset */
#define ICM_RCTRL_REG_OFST             _UINT32_(0x08)      /* (ICM_RCTRL) Region Control Offset */
#define ICM_RNEXT_REG_OFST             _UINT32_(0x0C)      /* (ICM_RNEXT) Region Next Address Offset */
#define ICM_CFG_REG_OFST               _UINT32_(0x00)      /* (ICM_CFG) Configuration Register Offset */
#define ICM_CTRL_REG_OFST              _UINT32_(0x04)      /* (ICM_CTRL) Control Register Offset */
#define ICM_SR_REG_OFST                _UINT32_(0x08)      /* (ICM_SR) Status Register Offset */
#define ICM_IER_REG_OFST               _UINT32_(0x10)      /* (ICM_IER) Interrupt Enable Register Offset */
#define ICM_IDR_REG_OFST               _UINT32_(0x14)      /* (ICM_IDR) Interrupt Disable Register Offset */
#define ICM_IMR_REG_OFST               _UINT32_(0x18)      /* (ICM_IMR) Interrupt Mask Register Offset */
#define ICM_ISR_REG_OFST               _UINT32_(0x1C)      /* (ICM_ISR) Interrupt Status Register Offset */
#define ICM_UASR_REG_OFST              _UINT32_(0x20)      /* (ICM_UASR) Undefined Access Status Register Offset */
#define ICM_DSCR_REG_OFST              _UINT32_(0x30)      /* (ICM_DSCR) Region Descriptor Area Start Address Register Offset */
#define ICM_HASH_REG_OFST              _UINT32_(0x34)      /* (ICM_HASH) Region Hash Area Start Address Register Offset */
#define ICM_UIHVAL_REG_OFST            _UINT32_(0x38)      /* (ICM_UIHVAL) User Initial Hash Value 0 Register Offset */
#define ICM_UIHVAL0_REG_OFST           _UINT32_(0x38)      /* (ICM_UIHVAL0) User Initial Hash Value 0 Register Offset */
#define ICM_UIHVAL1_REG_OFST           _UINT32_(0x3C)      /* (ICM_UIHVAL1) User Initial Hash Value 0 Register Offset */
#define ICM_UIHVAL2_REG_OFST           _UINT32_(0x40)      /* (ICM_UIHVAL2) User Initial Hash Value 0 Register Offset */
#define ICM_UIHVAL3_REG_OFST           _UINT32_(0x44)      /* (ICM_UIHVAL3) User Initial Hash Value 0 Register Offset */
#define ICM_UIHVAL4_REG_OFST           _UINT32_(0x48)      /* (ICM_UIHVAL4) User Initial Hash Value 0 Register Offset */
#define ICM_UIHVAL5_REG_OFST           _UINT32_(0x4C)      /* (ICM_UIHVAL5) User Initial Hash Value 0 Register Offset */
#define ICM_UIHVAL6_REG_OFST           _UINT32_(0x50)      /* (ICM_UIHVAL6) User Initial Hash Value 0 Register Offset */
#define ICM_UIHVAL7_REG_OFST           _UINT32_(0x54)      /* (ICM_UIHVAL7) User Initial Hash Value 0 Register Offset */
#define ICM_WPMR_REG_OFST              _UINT32_(0xE4)      /* (ICM_WPMR) ICM Write Protection Mode Register Offset */
#define ICM_WPSR_REG_OFST              _UINT32_(0xE8)      /* (ICM_WPSR) ICM Write Protection Status Register Offset */

